<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"930be5befe61f3d8e4143bf5451f4e02d7cc163dad038181cb19793443acdec8","plan_job_ref":"Job Test terraform-refresh #15 at https://github.com/dflook/terraform-github-actions/actions/runs/14146045919","plan_out_hash":"37de64d4b8add52ac969620049a90906f5793d51f3c12032fd2bbe0825aa631d","plan_hash":"283df95df7443384b8359915e113d2c142497cea8da2a79922d542ed8eb0468d","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-refresh__
:recycle: Skipping refresh of resource state
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.one will be created
+   resource "local_file" "one" {
+       content              = "this is my first file"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "test"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test terraform-refresh #15](https://github.com/dflook/terraform-github-actions/actions/runs/14146045919)